root@Leaf2#
root@Leaf2#
root@Leaf2# show bfd | tab
bfd profile
                           DESIRED                                                                                                                                                                            REMOTE
                           MINIMUM   REQUIRED                                                                                                                          REMOTE                                 MINIMUM                          HW                             HW
                           TX        MINIMUM   DETECTION   V4 HW    V6 HW    LOCAL                                                                SUBSCRIBED  SESSION  SESSION  LOCAL          REMOTE         RECEIVE   TRANSMITTED  RECEIVED  OFFLOAD             PARENT     ENDPOINT  NETWORK
ID       ID       ENABLED  INTERVAL  RECEIVE   MULTIPLIER  OFFLOAD  OFFLOAD  DISCRIMINATOR  LOCAL ADDRESS              REMOTE ADDRESS             PROTOCOLS   STATE    STATE    DISCRIMINATOR  DISCRIMINATOR  INTERVAL  PACKETS      PACKETS   STATUS   INTERFACE  INTERFACE  ID        INSTANCE
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
GLOBAL   GLOBAL   true     1000      1000      3           true     true     29             62.1.1.2                   62.1.1.6                   [ LAG ]     UP       UP       29             15             150       1055         554       true     swp1       bond12     2         default
                                                                             30             62.1.1.2                   62.1.1.6                   [ LAG ]     UP       UP       30             11             150       1049         1053      true     swp19      bond12     3         default
                                                                             31             62:1:1::1                  62:1:1::6                  [ LAG ]     UP       UP       31             16             150       1054         1056      true     swp1       bond12     1         default
                                                                             33             62:1:1::1                  62:1:1::6                  [ LAG ]     UP       UP       33             12             150       1054         1054      true     swp19      bond12     4         default
                                                                             34             fe80::b6a9:fcff:fe09:f44f  fe80::dac4:97ff:fed1:bb2c  [ ISIS ]    UP       UP       34             18             150       1052         1047      true     bond12     -          5         default
                                                                             35             62.1.1.2                   62.1.1.6                   [ ISIS ]    DOWN     DOWN     35             0              0         1047         0         true     bond12     -          6         default
GLOBAL2  GLOBAL2  true     100       100       3           true     true



BCM.0>
BCM.0> fp show group 4
fp show group 4
GID          4: gid=0x4, instance=0 mode=Double, stage=Ingress lookup=Enabled, ActionResId={-1}, pbmp={0x0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000888888888888888822223e3e22
222223}
         qset={DstMac, EtherType, Stage, StageIngress, InterfaceClassL2, InterfaceClassL3, IcmpTypeCode, MyStationHit, InterfaceClassVPort, BfdYourDiscriminator, PktType},
         aset={CosQCpuNew, CopyToCpu, Drop, PolicerGroup, StatGroup, BFDSessionIdNew},
         Qualifiers in Part-0: {EtherType->InterfaceClassL2->InterfaceClassVPort->BfdYourDiscriminator->PktType},
         Qualifiers in Part-1: {DstMac->InterfaceClassL3->IcmpTypeCode->MyStationHit},

         group_priority= 20
         slice_primary =  {slice_number=3, Entry count=768(0x300), Entry free=760(0x2f8)},
         slice_secondary = {slice_number=4}
         group_status={prio_min=0, prio_max=0, entries_total=2304, entries_free=2296,
                       counters_total=83968, counters_free=66040, meters_total=6144, meters_free=5376}
EID 0x00000166: gid=0x4,
 slice=3, slice_idx=0, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x00000000
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000012
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=2047(0x7ff), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 83  slice = 9 idx=3 entries=1}{Packets}
         Extended statistics=NULL
EID 0x00000167: gid=0x4,
 slice=3, slice_idx=0x1, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0x1, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x00000000
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000011
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=2047(0x7ff), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 84  slice = 9 idx=2 entries=1}{Packets}
         Extended statistics=NULL
EID 0x0000016e: gid=0x4,
 slice=3, slice_idx=0x3, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0x3, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator                                                                                                                                                                                                                                                                                           [1526/6547]
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x0000001d
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000012
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=2(0x2), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 91  slice = 9 idx=6 entries=1}{Packets}
         Extended statistics=NULL
EID 0x0000016f: gid=0x4,
 slice=3, slice_idx=0x4, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0x4, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x0000001e
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000012
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=3(0x3), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 92  slice = 9 idx=5 entries=1}{Packets}
         Extended statistics=NULL
EID 0x00000170: gid=0x4,
 slice=3, slice_idx=0x2, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0x2, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x0000001f
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000011
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=1(0x1), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 93  slice = 9 idx=4 entries=1}{Packets}
         Extended statistics=NULL


EID 0x00000172: gid=0x4,
 slice=3, slice_idx=0x5, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0x5, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x00000021
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000011
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=4(0x4), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 95  slice = 9 idx=7 entries=1}{Packets}
         Extended statistics=NULL
EID 0x00000173: gid=0x4,
 slice=3, slice_idx=0x6, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0x6, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x00000022
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000011
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=5(0x5), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 96  slice = 9 idx=15 entries=1}{Packets}
         Extended statistics=NULL
EID 0x00000174: gid=0x4,
 slice=3, slice_idx=0x7, part=0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1
 slice=4, slice_idx=0x7, part=1, prio=0, flags=0x810604, Installed, Enabled, color_indep=1

 BfdYourDiscriminator
    Part:0 Offset0:  0 Width0:  16
    Part:0 Offset1: 20 Width1:  16
    DATA=0x00000023
    MASK=0xffffffff
 PktType
    Part:0 Offset0: 44 Width0:   4
    Part:0 Offset1: 80 Width1:   4
    DATA=0x00000012
    MASK=0x0000007f
         action={act=CopyToCpu, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=CosQCpuNew, param0=46(0x2e), param1=46(0x2e), param2=0(0), param3=0(0)}
         action={act=BFDSessionIdNew, param0=6(0x6), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 97  slice = 9 idx=14 entries=1}{Packets}
         Extended statistics=NULL
BCM.0>

BCM.0>
BCM.0> fp stat get statid=84 t=p
The value is: 0x0000003ff
BCM.0>
BCM.0> fp stat get statid=91 t=p
The value is: 0x000000212
BCM.0>
BCM.0> fp stat get statid=92 t=p
The value is: 0x0000002f6
BCM.0>
BCM.0> fp stat get statid=93 t=p
The value is: 0x0000003fe
BCM.0>
BCM.0> fp stat get statid=95 t=p
The value is: 0x0000003fe
BCM.0>
BCM.0> fp stat get statid=96 t=p
The value is: 0x000000000
BCM.0>
BCM.0> fp stat get statid=97 t=p
The value is: 0x0000001ea
BCM.0>
BCM.0>
BCM.0>
BCM.0> cint
Entering C Interpreter. Type 'exit;' to quit.

cint>
cint> bcm_bfd_endpoint_stat_t ctr_info_1;
** error: identifier 'ctr_info_1' redeclared
cint>
cint> int unit = 0;
** error: identifier 'unit' redeclared
cint>
cint> print bcm_bfd_endpoint_stat_get(unit, 1, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);
int $$ = 0 (0x0)
cint>
cint> print ctr_info_1;
bcm_bfd_endpoint_stat_t ctr_info_1 = {
    unsigned int packets_in = 0 (0x0)
    unsigned int packets_out = 0 (0x0)
    unsigned int packets_drop = 0 (0x0)
    unsigned int packets_auth_drop = 0 (0x0)
    uint64 packets_in_64 = {0x00000000 0x000003FE}
    uint64 packets_out_64 = {0x00000000 0x000003FE}
    uint64 packets_drop_64 = {0x00000000 0x00000000}
    uint64 packets_auth_drop_64 = {0x00000000 0x00000000}
    uint64 packets_echo_reply = {0x00000000 0x00000000}
}
cint>
cint> print bcm_bfd_endpoint_stat_get(unit, 2, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);
int $$ = 0 (0x0)
cint>
cint> print ctr_info_1;
bcm_bfd_endpoint_stat_t ctr_info_1 = {
    unsigned int packets_in = 0 (0x0)
    unsigned int packets_out = 0 (0x0)
    unsigned int packets_drop = 0 (0x0)
    unsigned int packets_auth_drop = 0 (0x0)
    uint64 packets_in_64 = {0x00000000 0x00000212}
    uint64 packets_out_64 = {0x00000000 0x000003FF}
    uint64 packets_drop_64 = {0x00000000 0x00000000}
    uint64 packets_auth_drop_64 = {0x00000000 0x00000000}
    uint64 packets_echo_reply = {0x00000000 0x00000000}
}
cint>
cint>
cint> print bcm_bfd_endpoint_stat_get(unit, 3, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);
int $$ = 0 (0x0)
cint>
cint> print ctr_info_1;
bcm_bfd_endpoint_stat_t ctr_info_1 = {
    unsigned int packets_in = 0 (0x0)
    unsigned int packets_out = 0 (0x0)
    unsigned int packets_drop = 0 (0x0)
    unsigned int packets_auth_drop = 0 (0x0)
    uint64 packets_in_64 = {0x00000000 0x000003FD}
    uint64 packets_out_64 = {0x00000000 0x000003F8}
    uint64 packets_drop_64 = {0x00000000 0x00000404}
    uint64 packets_auth_drop_64 = {0x00000000 0x00000000}
    uint64 packets_echo_reply = {0x00000000 0x00000000}
}
cint>
cint> print bcm_bfd_endpoint_stat_get(unit, 4, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);
int $$ = 0 (0x0)
cint>
cint> print ctr_info_1;
bcm_bfd_endpoint_stat_t ctr_info_1 = {
    unsigned int packets_in = 0 (0x0)
    unsigned int packets_out = 0 (0x0)
    unsigned int packets_drop = 0 (0x0)
    unsigned int packets_auth_drop = 0 (0x0)
    uint64 packets_in_64 = {0x00000000 0x000003FE}
    uint64 packets_out_64 = {0x00000000 0x000003FF}
    uint64 packets_drop_64 = {0x00000000 0x00000000}
    uint64 packets_auth_drop_64 = {0x00000000 0x00000000}
    uint64 packets_echo_reply = {0x00000000 0x00000000}
}
cint>
cint>
cint> print bcm_bfd_endpoint_stat_get(unit, 5, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);
int $$ = 0 (0x0)
cint>
cint> fo_1;
print bcm_bfd_endpoint_stat_get(unit, 6, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);
print ctr_info_1;
exit;
print ctr_info_1;
print bcm_bfd_endpoint_stat_get(unit, 6, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);

print ctr_info_1;

exit;

bcm_bfd_endpoint_stat_t ctr_info_1 = {
    unsigned int packets_in = 0 (0x0)
    unsigned int packets_out = 0 (0x0)
    unsigned int packets_drop = 0 (0x0)
    unsigned int packets_auth_drop = 0 (0x0)
    uint64 packets_in_64 = {0x00000000 0x000003F7}
    uint64 packets_out_64 = {0x00000000 0x000003FB}
    uint64 packets_drop_64 = {0x00000000 0x00000000}
    uint64 packets_auth_drop_64 = {0x00000000 0x00000000}
    uint64 packets_echo_reply = {0x00000000 0x00000000}
}
cint>
cint> print bcm_bfd_endpoint_stat_get(unit, 6, &ctr_info_1, BCM_BFD_ENDPOINT_STAT_64BIT);
int $$ = 0 (0x0)
cint>
cint> print ctr_info_1;
bcm_bfd_endpoint_stat_t ctr_info_1 = {
    unsigned int packets_in = 0 (0x0)
    unsigned int packets_out = 0 (0x0)
    unsigned int packets_drop = 0 (0x0)
    unsigned int packets_auth_drop = 0 (0x0)
    uint64 packets_in_64 = {0x00000000 0x00000000}
    uint64 packets_out_64 = {0x00000000 0x000003F7}
    uint64 packets_drop_64 = {0x00000000 0x000001EA}
    uint64 packets_auth_drop_64 = {0x00000000 0x00000000}
    uint64 packets_echo_reply = {0x00000000 0x00000000}
}
cint>
cint>
cint> print ep_info;
bcm_bfd_endpoint_info_t ep_info = {
    unsigned int flags = 128 (0x80)
    int id = 1 (0x1)
    int remote_id = 0 (0x0)
    bcm_bfd_tunnel_type_t type = bcmBFDTunnelTypeUdp (0)
    int gport = 67108893 (0x400001d)
    int tx_gport = -1 (0xffffffff)
    int remote_gport = -1 (0xffffffff)
    int bfd_period = 0 (0x0)
    bcm_vlan_t vpn = 0 (0x0000)
    unsigned char vlan_pri = 0 (0x00)
    unsigned char inner_vlan_pri = 0 (0x00)
    int vrf_id = 0 (0x0)
    uint8[6] dst_mac = 00:00:00:00:00:00
    uint8[6] src_mac = 00:00:00:00:00:00
    uint16 pkt_inner_vlan_id = 0 (0x0000)
    uint32 dst_ip_addr = 0.0.0.0
    uint8[16] dst_ip6_addr = 0062:0001:0001:0000:0000:0000:0000:0006
    uint32 src_ip_addr = 0.0.0.0
    uint8[16] src_ip6_addr = 0062:0001:0001:0000:0000:0000:0000:0001
    unsigned char ip_tos = 0 (0x00)
    unsigned char ip_ttl = 255 (0xff)
    uint32 inner_dst_ip_addr = 0.0.0.0
    uint8[16] inner_dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 inner_src_ip_addr = 0.0.0.0
    uint8[16] inner_src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char inner_ip_tos = 0 (0x00)
    unsigned char inner_ip_ttl = 0 (0x00)
    unsigned int udp_src_port = 49182 (0xc01e)
    uint32 label = 0 (0x0)
    uint32 mpls_hdr = 0 (0x0)
    bcm_mpls_egress_label_t egress_label = {
        unsigned int flags = 0 (0x0)
        unsigned int flags2 = 0 (0x0)
        uint32 label = 4294967295 (0xffffffff)
        int qos_map_id = 0 (0x0)
        unsigned char exp = 255 (0xff)
        unsigned char ttl = 0 (0x00)
        unsigned char pkt_pri = 0 (0x00)
        unsigned char pkt_cfi = 0 (0x00)
        int tunnel_id = 0 (0x0)
        int l3_intf_id = 0 (0x0)
        bcm_mpls_egress_action_t action = BCM_MPLS_EGRESS_ACTION_SWAP (0)
        int ecn_map_id = 0 (0x0)
        int int_cn_map_id = 0 (0x0)
        int egress_failover_id = 0 (0x0)
        int egress_failover_if_id = 0 (0x0)
        int outlif_counting_profile = -1 (0xffffffff)
        bcm_mpls_special_label_push_type_t spl_label_push_type = bcmMplsSpecialLabelPushNone (0)
        bcm_encap_access_t encap_access = bcmEncapAccessInvalid (0)
        bcm_qos_egress_model_t egress_qos_model = {
            bcm_qos_egress_model_type_t egress_qos = bcmQosEgressModelUniform (0)
            bcm_qos_egress_model_type_t egress_ttl = bcmQosEgressModelUniform (0)
            bcm_qos_egress_ecn_model_type_t egress_ecn = bcmQosEgressEcnModelInvalid (0)
        }
        int estimated_encap_size = 0 (0x0)
    }
    int egress_if = 100461 (0x1886d)
    unsigned char[32] mep_id = {
        unsigned char mep_id[0] = 0 (0x00)
        unsigned char mep_id[1] = 0 (0x00)
        unsigned char mep_id[2] = 0 (0x00)
        unsigned char mep_id[3] = 0 (0x00)
        unsigned char mep_id[4] = 0 (0x00)
        unsigned char mep_id[5] = 0 (0x00)
        unsigned char mep_id[6] = 0 (0x00)
        unsigned char mep_id[7] = 0 (0x00)
        unsigned char mep_id[8] = 0 (0x00)
        unsigned char mep_id[9] = 0 (0x00)
        unsigned char mep_id[10] = 0 (0x00)
        unsigned char mep_id[11] = 0 (0x00)
        unsigned char mep_id[12] = 0 (0x00)
        unsigned char mep_id[13] = 0 (0x00)
        unsigned char mep_id[14] = 0 (0x00)
        unsigned char mep_id[15] = 0 (0x00)
        unsigned char mep_id[16] = 0 (0x00)
        unsigned char mep_id[17] = 0 (0x00)
        unsigned char mep_id[18] = 0 (0x00)
        unsigned char mep_id[19] = 0 (0x00)
        unsigned char mep_id[20] = 0 (0x00)
        unsigned char mep_id[21] = 0 (0x00)
        unsigned char mep_id[22] = 0 (0x00)
        unsigned char mep_id[23] = 0 (0x00)
        unsigned char mep_id[24] = 0 (0x00)
        unsigned char mep_id[25] = 0 (0x00)
        unsigned char mep_id[26] = 0 (0x00)
        unsigned char mep_id[27] = 0 (0x00)
        unsigned char mep_id[28] = 0 (0x00)
        unsigned char mep_id[29] = 0 (0x00)
        unsigned char mep_id[30] = 0 (0x00)
        unsigned char mep_id[31] = 0 (0x00)
    }
    unsigned char mep_id_length = 0 (0x00)
    int int_pri = 7 (0x7)
    unsigned char cpu_qid = 0 (0x00)
    bcm_bfd_state_t local_state = bcmBFDStateUp (3)
    unsigned int local_discr = 31 (0x1f)
    bcm_bfd_diag_code_t local_diag = bcmBFDDiagCodeNone (0)
    unsigned int local_flags = 0 (0x0)
    unsigned int local_min_tx = 1000000 (0xf4240)
    unsigned int local_min_rx = 1000000 (0xf4240)
    unsigned int local_min_echo = 0 (0x0)
    unsigned char local_detect_mult = 3 (0x03)
    bcm_bfd_auth_type_t auth = bcmBFDAuthTypeNone (0)
    unsigned int auth_index = 0 (0x0)
    unsigned int tx_auth_seq = 1987421822 (0x7675a67e)
    unsigned int rx_auth_seq = 0 (0x0)
    unsigned int remote_flags = 0 (0x0)
    bcm_bfd_state_t remote_state = bcmBFDStateUp (3)
    unsigned int remote_discr = 16 (0x10)
    bcm_bfd_diag_code_t remote_diag = bcmBFDDiagCodeNone (0)
    unsigned int remote_min_tx = 150000 (0x249f0)
    unsigned int remote_min_rx = 150000 (0x249f0)
    unsigned int remote_min_echo = 0 (0x0)
    unsigned char remote_detect_mult = 3 (0x03)
    int sampling_ratio = 0 (0x0)
    unsigned char loc_clear_threshold = 0 (0x00)
    unsigned int ip_subnet_length = 0 (0x0)
    unsigned char[32] remote_mep_id = {
        unsigned char remote_mep_id[0] = 0 (0x00)
        unsigned char remote_mep_id[1] = 0 (0x00)
        unsigned char remote_mep_id[2] = 0 (0x00)
        unsigned char remote_mep_id[3] = 0 (0x00)
        unsigned char remote_mep_id[4] = 0 (0x00)
        unsigned char remote_mep_id[5] = 0 (0x00)
        unsigned char remote_mep_id[6] = 0 (0x00)
        unsigned char remote_mep_id[7] = 0 (0x00)
        unsigned char remote_mep_id[8] = 0 (0x00)
        unsigned char remote_mep_id[9] = 0 (0x00)
        unsigned char remote_mep_id[10] = 0 (0x00)
        unsigned char remote_mep_id[11] = 0 (0x00)
        unsigned char remote_mep_id[12] = 0 (0x00)
        unsigned char remote_mep_id[13] = 0 (0x00)
        unsigned char remote_mep_id[14] = 0 (0x00)
        unsigned char remote_mep_id[15] = 0 (0x00)
        unsigned char remote_mep_id[16] = 0 (0x00)
        unsigned char remote_mep_id[17] = 0 (0x00)
        unsigned char remote_mep_id[18] = 0 (0x00)
        unsigned char remote_mep_id[19] = 0 (0x00)
        unsigned char remote_mep_id[20] = 0 (0x00)
        unsigned char remote_mep_id[21] = 0 (0x00)
        unsigned char remote_mep_id[22] = 0 (0x00)
        unsigned char remote_mep_id[23] = 0 (0x00)
        unsigned char remote_mep_id[24] = 0 (0x00)
        unsigned char remote_mep_id[25] = 0 (0x00)
        unsigned char remote_mep_id[26] = 0 (0x00)
        unsigned char remote_mep_id[27] = 0 (0x00)
        unsigned char remote_mep_id[28] = 0 (0x00)
        unsigned char remote_mep_id[29] = 0 (0x00)
        unsigned char remote_mep_id[30] = 0 (0x00)
        unsigned char remote_mep_id[31] = 0 (0x00)
    }
    unsigned char remote_mep_id_length = 0 (0x00)
    unsigned char[32] mis_conn_mep_id = {
        unsigned char mis_conn_mep_id[0] = 0 (0x00)
        unsigned char mis_conn_mep_id[1] = 0 (0x00)
        unsigned char mis_conn_mep_id[2] = 0 (0x00)
        unsigned char mis_conn_mep_id[3] = 0 (0x00)
        unsigned char mis_conn_mep_id[4] = 0 (0x00)
        unsigned char mis_conn_mep_id[5] = 0 (0x00)
        unsigned char mis_conn_mep_id[6] = 0 (0x00)
        unsigned char mis_conn_mep_id[7] = 0 (0x00)
        unsigned char mis_conn_mep_id[8] = 0 (0x00)
        unsigned char mis_conn_mep_id[9] = 0 (0x00)
        unsigned char mis_conn_mep_id[10] = 0 (0x00)
        unsigned char mis_conn_mep_id[11] = 0 (0x00)
        unsigned char mis_conn_mep_id[12] = 0 (0x00)
        unsigned char mis_conn_mep_id[13] = 0 (0x00)
        unsigned char mis_conn_mep_id[14] = 0 (0x00)
        unsigned char mis_conn_mep_id[15] = 0 (0x00)
        unsigned char mis_conn_mep_id[16] = 0 (0x00)
        unsigned char mis_conn_mep_id[17] = 0 (0x00)
        unsigned char mis_conn_mep_id[18] = 0 (0x00)
        unsigned char mis_conn_mep_id[19] = 0 (0x00)
        unsigned char mis_conn_mep_id[20] = 0 (0x00)
        unsigned char mis_conn_mep_id[21] = 0 (0x00)
        unsigned char mis_conn_mep_id[22] = 0 (0x00)
        unsigned char mis_conn_mep_id[23] = 0 (0x00)
        unsigned char mis_conn_mep_id[24] = 0 (0x00)
        unsigned char mis_conn_mep_id[25] = 0 (0x00)
        unsigned char mis_conn_mep_id[26] = 0 (0x00)
        unsigned char mis_conn_mep_id[27] = 0 (0x00)
        unsigned char mis_conn_mep_id[28] = 0 (0x00)
        unsigned char mis_conn_mep_id[29] = 0 (0x00)
        unsigned char mis_conn_mep_id[30] = 0 (0x00)
        unsigned char mis_conn_mep_id[31] = 0 (0x00)
    }
    unsigned char mis_conn_mep_id_length = 0 (0x00)
    unsigned int bfd_detection_time = 0 (0x0)
    uint16 pkt_vlan_id = 0 (0x0000)
    uint16 rx_pkt_vlan_id = 0 (0x0000)
    uint32 gal_label = 0 (0x0)
    unsigned int faults = 0 (0x0)
    unsigned int flags2 = 0 (0x0)
    int ipv6_extra_data_index = 0 (0x0)
    int punt_good_packet_period = 0 (0x0)
    unsigned char bfd_period_cluster = 0 (0x00)
    unsigned int vxlan_vnid = 0 (0x0)
    unsigned short vlan_tpid = 0 (0x0000)
    unsigned short inner_vlan_tpid = 0 (0x0000)
    int injected_network_qos = 0 (0x0)
    int profile_id = 0 (0x0)
    unsigned char injected_core_id = 0 (0x00)
}
cint>
cint>
cint>
cint> bcm_bfd_endpoint_info_t_init(&ep_info);
cint>
cint> print bcm_bfd_endpoint_get(0, 2, &ep_info);
int $$ = 0 (0x0)
cint>
cint> print ep_info;
bcm_bfd_endpoint_info_t ep_info = {
    unsigned int flags = 0 (0x0)
    int id = 2 (0x2)
    int remote_id = 0 (0x0)
    bcm_bfd_tunnel_type_t type = bcmBFDTunnelTypeUdp (0)
    int gport = 67108893 (0x400001d)
    int tx_gport = -1 (0xffffffff)
    int remote_gport = -1 (0xffffffff)
    int bfd_period = 0 (0x0)
    bcm_vlan_t vpn = 0 (0x0000)
    unsigned char vlan_pri = 0 (0x00)
    unsigned char inner_vlan_pri = 0 (0x00)
    int vrf_id = 0 (0x0)
    uint8[6] dst_mac = 00:00:00:00:00:00
    uint8[6] src_mac = 00:00:00:00:00:00
    uint16 pkt_inner_vlan_id = 0 (0x0000)
    uint32 dst_ip_addr = 62.1.1.6
    uint8[16] dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 src_ip_addr = 62.1.1.2
    uint8[16] src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char ip_tos = 0 (0x00)
    unsigned char ip_ttl = 255 (0xff)
    uint32 inner_dst_ip_addr = 0.0.0.0
    uint8[16] inner_dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 inner_src_ip_addr = 0.0.0.0
    uint8[16] inner_src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char inner_ip_tos = 0 (0x00)
    unsigned char inner_ip_ttl = 0 (0x00)
    unsigned int udp_src_port = 49180 (0xc01c)
    uint32 label = 0 (0x0)
    uint32 mpls_hdr = 0 (0x0)
    bcm_mpls_egress_label_t egress_label = {
        unsigned int flags = 0 (0x0)
        unsigned int flags2 = 0 (0x0)
        uint32 label = 4294967295 (0xffffffff)
        int qos_map_id = 0 (0x0)
        unsigned char exp = 255 (0xff)
        unsigned char ttl = 0 (0x00)
        unsigned char pkt_pri = 0 (0x00)
        unsigned char pkt_cfi = 0 (0x00)
        int tunnel_id = 0 (0x0)
        int l3_intf_id = 0 (0x0)
        bcm_mpls_egress_action_t action = BCM_MPLS_EGRESS_ACTION_SWAP (0)
        int ecn_map_id = 0 (0x0)
        int int_cn_map_id = 0 (0x0)
        int egress_failover_id = 0 (0x0)
        int egress_failover_if_id = 0 (0x0)
        int outlif_counting_profile = -1 (0xffffffff)
        bcm_mpls_special_label_push_type_t spl_label_push_type = bcmMplsSpecialLabelPushNone (0)
        bcm_encap_access_t encap_access = bcmEncapAccessInvalid (0)
        bcm_qos_egress_model_t egress_qos_model = {
            bcm_qos_egress_model_type_t egress_qos = bcmQosEgressModelUniform (0)
            bcm_qos_egress_model_type_t egress_ttl = bcmQosEgressModelUniform (0)
            bcm_qos_egress_ecn_model_type_t egress_ecn = bcmQosEgressEcnModelInvalid (0)
        }
        int estimated_encap_size = 0 (0x0)
    }
    int egress_if = 100461 (0x1886d)
    unsigned char[32] mep_id = {
        unsigned char mep_id[0] = 0 (0x00)
        unsigned char mep_id[1] = 0 (0x00)
        unsigned char mep_id[2] = 0 (0x00)
        unsigned char mep_id[3] = 0 (0x00)
        unsigned char mep_id[4] = 0 (0x00)
        unsigned char mep_id[5] = 0 (0x00)
        unsigned char mep_id[6] = 0 (0x00)
        unsigned char mep_id[7] = 0 (0x00)
        unsigned char mep_id[8] = 0 (0x00)
        unsigned char mep_id[9] = 0 (0x00)
        unsigned char mep_id[10] = 0 (0x00)
        unsigned char mep_id[11] = 0 (0x00)
        unsigned char mep_id[12] = 0 (0x00)
        unsigned char mep_id[13] = 0 (0x00)
        unsigned char mep_id[14] = 0 (0x00)
        unsigned char mep_id[15] = 0 (0x00)
        unsigned char mep_id[16] = 0 (0x00)
        unsigned char mep_id[17] = 0 (0x00)
        unsigned char mep_id[18] = 0 (0x00)
        unsigned char mep_id[19] = 0 (0x00)
        unsigned char mep_id[20] = 0 (0x00)
        unsigned char mep_id[21] = 0 (0x00)
        unsigned char mep_id[22] = 0 (0x00)
        unsigned char mep_id[23] = 0 (0x00)
        unsigned char mep_id[24] = 0 (0x00)
        unsigned char mep_id[25] = 0 (0x00)
        unsigned char mep_id[26] = 0 (0x00)
        unsigned char mep_id[27] = 0 (0x00)
        unsigned char mep_id[28] = 0 (0x00)
        unsigned char mep_id[29] = 0 (0x00)
        unsigned char mep_id[30] = 0 (0x00)
        unsigned char mep_id[31] = 0 (0x00)
    }
    unsigned char mep_id_length = 0 (0x00)
    int int_pri = 7 (0x7)
    unsigned char cpu_qid = 0 (0x00)
    bcm_bfd_state_t local_state = bcmBFDStateUp (3)
    unsigned int local_discr = 29 (0x1d)
    bcm_bfd_diag_code_t local_diag = bcmBFDDiagCodeNone (0)
    unsigned int local_flags = 0 (0x0)
    unsigned int local_min_tx = 1000000 (0xf4240)
    unsigned int local_min_rx = 1000000 (0xf4240)
    unsigned int local_min_echo = 0 (0x0)
    unsigned char local_detect_mult = 3 (0x03)
    bcm_bfd_auth_type_t auth = bcmBFDAuthTypeNone (0)
    unsigned int auth_index = 0 (0x0)
    unsigned int tx_auth_seq = 655839903 (0x2717529f)
    unsigned int rx_auth_seq = 0 (0x0)
    unsigned int remote_flags = 0 (0x0)
    bcm_bfd_state_t remote_state = bcmBFDStateUp (3)
    unsigned int remote_discr = 15 (0xf)
    bcm_bfd_diag_code_t remote_diag = bcmBFDDiagCodeNone (0)
    unsigned int remote_min_tx = 150000 (0x249f0)
    unsigned int remote_min_rx = 150000 (0x249f0)
    unsigned int remote_min_echo = 0 (0x0)
    unsigned char remote_detect_mult = 3 (0x03)
    int sampling_ratio = 0 (0x0)
    unsigned char loc_clear_threshold = 0 (0x00)
    unsigned int ip_subnet_length = 0 (0x0)
    unsigned char[32] remote_mep_id = {
        unsigned char remote_mep_id[0] = 0 (0x00)
        unsigned char remote_mep_id[1] = 0 (0x00)
        unsigned char remote_mep_id[2] = 0 (0x00)
        unsigned char remote_mep_id[3] = 0 (0x00)
        unsigned char remote_mep_id[4] = 0 (0x00)
        unsigned char remote_mep_id[5] = 0 (0x00)
        unsigned char remote_mep_id[6] = 0 (0x00)
        unsigned char remote_mep_id[7] = 0 (0x00)
        unsigned char remote_mep_id[8] = 0 (0x00)
        unsigned char remote_mep_id[9] = 0 (0x00)
        unsigned char remote_mep_id[10] = 0 (0x00)
        unsigned char remote_mep_id[11] = 0 (0x00)
        unsigned char remote_mep_id[12] = 0 (0x00)
        unsigned char remote_mep_id[13] = 0 (0x00)
        unsigned char remote_mep_id[14] = 0 (0x00)
        unsigned char remote_mep_id[15] = 0 (0x00)
        unsigned char remote_mep_id[16] = 0 (0x00)
        unsigned char remote_mep_id[17] = 0 (0x00)
        unsigned char remote_mep_id[18] = 0 (0x00)
        unsigned char remote_mep_id[19] = 0 (0x00)
        unsigned char remote_mep_id[20] = 0 (0x00)
        unsigned char remote_mep_id[21] = 0 (0x00)
        unsigned char remote_mep_id[22] = 0 (0x00)
        unsigned char remote_mep_id[23] = 0 (0x00)
        unsigned char remote_mep_id[24] = 0 (0x00)
        unsigned char remote_mep_id[25] = 0 (0x00)
        unsigned char remote_mep_id[26] = 0 (0x00)
        unsigned char remote_mep_id[27] = 0 (0x00)
        unsigned char remote_mep_id[28] = 0 (0x00)
        unsigned char remote_mep_id[29] = 0 (0x00)
        unsigned char remote_mep_id[30] = 0 (0x00)
        unsigned char remote_mep_id[31] = 0 (0x00)
    }
    unsigned char remote_mep_id_length = 0 (0x00)
    unsigned char[32] mis_conn_mep_id = {
        unsigned char mis_conn_mep_id[0] = 0 (0x00)
        unsigned char mis_conn_mep_id[1] = 0 (0x00)
        unsigned char mis_conn_mep_id[2] = 0 (0x00)
        unsigned char mis_conn_mep_id[3] = 0 (0x00)
        unsigned char mis_conn_mep_id[4] = 0 (0x00)
        unsigned char mis_conn_mep_id[5] = 0 (0x00)
        unsigned char mis_conn_mep_id[6] = 0 (0x00)
        unsigned char mis_conn_mep_id[7] = 0 (0x00)
        unsigned char mis_conn_mep_id[8] = 0 (0x00)
        unsigned char mis_conn_mep_id[9] = 0 (0x00)
        unsigned char mis_conn_mep_id[10] = 0 (0x00)
        unsigned char mis_conn_mep_id[11] = 0 (0x00)
        unsigned char mis_conn_mep_id[12] = 0 (0x00)
        unsigned char mis_conn_mep_id[13] = 0 (0x00)
        unsigned char mis_conn_mep_id[14] = 0 (0x00)
        unsigned char mis_conn_mep_id[15] = 0 (0x00)
        unsigned char mis_conn_mep_id[16] = 0 (0x00)
        unsigned char mis_conn_mep_id[17] = 0 (0x00)
        unsigned char mis_conn_mep_id[18] = 0 (0x00)
        unsigned char mis_conn_mep_id[19] = 0 (0x00)
        unsigned char mis_conn_mep_id[20] = 0 (0x00)
        unsigned char mis_conn_mep_id[21] = 0 (0x00)
        unsigned char mis_conn_mep_id[22] = 0 (0x00)
        unsigned char mis_conn_mep_id[23] = 0 (0x00)
        unsigned char mis_conn_mep_id[24] = 0 (0x00)
        unsigned char mis_conn_mep_id[25] = 0 (0x00)
        unsigned char mis_conn_mep_id[26] = 0 (0x00)
        unsigned char mis_conn_mep_id[27] = 0 (0x00)
        unsigned char mis_conn_mep_id[28] = 0 (0x00)
        unsigned char mis_conn_mep_id[29] = 0 (0x00)
        unsigned char mis_conn_mep_id[30] = 0 (0x00)
        unsigned char mis_conn_mep_id[31] = 0 (0x00)
    }
    unsigned char mis_conn_mep_id_length = 0 (0x00)
    unsigned int bfd_detection_time = 0 (0x0)
    uint16 pkt_vlan_id = 0 (0x0000)
    uint16 rx_pkt_vlan_id = 0 (0x0000)
    uint32 gal_label = 0 (0x0)
    unsigned int faults = 0 (0x0)
    unsigned int flags2 = 0 (0x0)
    int ipv6_extra_data_index = 0 (0x0)
    int punt_good_packet_period = 0 (0x0)
    unsigned char bfd_period_cluster = 0 (0x00)
    unsigned int vxlan_vnid = 0 (0x0)
    unsigned short vlan_tpid = 0 (0x0000)
    unsigned short inner_vlan_tpid = 0 (0x0000)
    int injected_network_qos = 0 (0x0)
    int profile_id = 0 (0x0)
    unsigned char injected_core_id = 0 (0x00)
}
cint>
cint>
cint>
cint>
cint>
cint>
cint> bcm_bfd_endpoint_info_t_init(&ep_info);
cint>
cint> print bcm_bfd_endpoint_get(0, 3, &ep_info);
int $$ = 0 (0x0)
cint>
cint> print ep_info;
bcm_bfd_endpoint_info_t ep_info = {
    unsigned int flags = 0 (0x0)
    int id = 3 (0x3)
    int remote_id = 0 (0x0)
    bcm_bfd_tunnel_type_t type = bcmBFDTunnelTypeUdp (0)
    int gport = 67108939 (0x400004b)
    int tx_gport = -1 (0xffffffff)
    int remote_gport = -1 (0xffffffff)
    int bfd_period = 0 (0x0)
    bcm_vlan_t vpn = 0 (0x0000)
    unsigned char vlan_pri = 0 (0x00)
    unsigned char inner_vlan_pri = 0 (0x00)
    int vrf_id = 0 (0x0)
    uint8[6] dst_mac = 00:00:00:00:00:00
    uint8[6] src_mac = 00:00:00:00:00:00
    uint16 pkt_inner_vlan_id = 0 (0x0000)
    uint32 dst_ip_addr = 62.1.1.6
    uint8[16] dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 src_ip_addr = 62.1.1.2
    uint8[16] src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char ip_tos = 0 (0x00)
    unsigned char ip_ttl = 255 (0xff)
    uint32 inner_dst_ip_addr = 0.0.0.0
    uint8[16] inner_dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 inner_src_ip_addr = 0.0.0.0
    uint8[16] inner_src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char inner_ip_tos = 0 (0x00)
    unsigned char inner_ip_ttl = 0 (0x00)
    unsigned int udp_src_port = 49181 (0xc01d)
    uint32 label = 0 (0x0)
    uint32 mpls_hdr = 0 (0x0)
    bcm_mpls_egress_label_t egress_label = {
        unsigned int flags = 0 (0x0)
        unsigned int flags2 = 0 (0x0)
        uint32 label = 4294967295 (0xffffffff)
        int qos_map_id = 0 (0x0)
        unsigned char exp = 255 (0xff)
        unsigned char ttl = 0 (0x00)
        unsigned char pkt_pri = 0 (0x00)
        unsigned char pkt_cfi = 0 (0x00)
        int tunnel_id = 0 (0x0)
        int l3_intf_id = 0 (0x0)
        bcm_mpls_egress_action_t action = BCM_MPLS_EGRESS_ACTION_SWAP (0)
        int ecn_map_id = 0 (0x0)
        int int_cn_map_id = 0 (0x0)
        int egress_failover_id = 0 (0x0)
        int egress_failover_if_id = 0 (0x0)
        int outlif_counting_profile = -1 (0xffffffff)
        bcm_mpls_special_label_push_type_t spl_label_push_type = bcmMplsSpecialLabelPushNone (0)
        bcm_encap_access_t encap_access = bcmEncapAccessInvalid (0)
        bcm_qos_egress_model_t egress_qos_model = {
            bcm_qos_egress_model_type_t egress_qos = bcmQosEgressModelUniform (0)
            bcm_qos_egress_model_type_t egress_ttl = bcmQosEgressModelUniform (0)
            bcm_qos_egress_ecn_model_type_t egress_ecn = bcmQosEgressEcnModelInvalid (0)
        }
        int estimated_encap_size = 0 (0x0)
    }
    unsigned char[32] mep_id = {
        unsigned char mep_id[0] = 0 (0x00)
        unsigned char mep_id[1] = 0 (0x00)
        unsigned char mep_id[2] = 0 (0x00)
        unsigned char mep_id[3] = 0 (0x00)
        unsigned char mep_id[4] = 0 (0x00)
        unsigned char mep_id[5] = 0 (0x00)
        unsigned char mep_id[6] = 0 (0x00)
        unsigned char mep_id[7] = 0 (0x00)
        unsigned char mep_id[8] = 0 (0x00)
        unsigned char mep_id[9] = 0 (0x00)
        unsigned char mep_id[10] = 0 (0x00)
        unsigned char mep_id[11] = 0 (0x00)
        unsigned char mep_id[12] = 0 (0x00)
        unsigned char mep_id[13] = 0 (0x00)
        unsigned char mep_id[14] = 0 (0x00)
        unsigned char mep_id[15] = 0 (0x00)
        unsigned char mep_id[16] = 0 (0x00)
        unsigned char mep_id[17] = 0 (0x00)
        unsigned char mep_id[18] = 0 (0x00)
        unsigned char mep_id[19] = 0 (0x00)
        unsigned char mep_id[20] = 0 (0x00)
        unsigned char mep_id[21] = 0 (0x00)
        unsigned char mep_id[22] = 0 (0x00)
        unsigned char mep_id[23] = 0 (0x00)
        unsigned char mep_id[24] = 0 (0x00)
        unsigned char mep_id[25] = 0 (0x00)
        unsigned char mep_id[26] = 0 (0x00)
        unsigned char mep_id[27] = 0 (0x00)
        unsigned char mep_id[28] = 0 (0x00)
        unsigned char mep_id[29] = 0 (0x00)
        unsigned char mep_id[30] = 0 (0x00)
        unsigned char mep_id[31] = 0 (0x00)
    }
    unsigned char mep_id_length = 0 (0x00)
    int int_pri = 7 (0x7)
    unsigned char cpu_qid = 0 (0x00)
    bcm_bfd_state_t local_state = bcmBFDStateUp (3)
    unsigned int local_discr = 30 (0x1e)
    bcm_bfd_diag_code_t local_diag = bcmBFDDiagCodeNone (0)
    unsigned int local_flags = 0 (0x0)
    unsigned int local_min_tx = 1000000 (0xf4240)
    unsigned int local_min_rx = 1000000 (0xf4240)
    unsigned int local_min_echo = 0 (0x0)
    unsigned char local_detect_mult = 3 (0x03)
    bcm_bfd_auth_type_t auth = bcmBFDAuthTypeNone (0)
    unsigned int auth_index = 0 (0x0)
    unsigned int tx_auth_seq = 798612029 (0x2f99da3d)
    unsigned int rx_auth_seq = 0 (0x0)
    unsigned int remote_flags = 0 (0x0)
    bcm_bfd_state_t remote_state = bcmBFDStateUp (3)
    unsigned int remote_discr = 17 (0x11)
    bcm_bfd_diag_code_t remote_diag = bcmBFDDiagCodeNone (0)
    unsigned int remote_min_tx = 150000 (0x249f0)
    unsigned int remote_min_rx = 150000 (0x249f0)
    unsigned int remote_min_echo = 0 (0x0)
    unsigned char remote_detect_mult = 3 (0x03)
    int sampling_ratio = 0 (0x0)
    unsigned char loc_clear_threshold = 0 (0x00)
    unsigned int ip_subnet_length = 0 (0x0)
    unsigned char[32] remote_mep_id = {
        unsigned char remote_mep_id[0] = 0 (0x00)
        unsigned char remote_mep_id[1] = 0 (0x00)
        unsigned char remote_mep_id[2] = 0 (0x00)
        unsigned char remote_mep_id[3] = 0 (0x00)
        unsigned char remote_mep_id[4] = 0 (0x00)
        unsigned char remote_mep_id[5] = 0 (0x00)
        unsigned char remote_mep_id[6] = 0 (0x00)
        unsigned char remote_mep_id[7] = 0 (0x00)
        unsigned char remote_mep_id[8] = 0 (0x00)
        unsigned char remote_mep_id[9] = 0 (0x00)
        unsigned char remote_mep_id[10] = 0 (0x00)
        unsigned char remote_mep_id[11] = 0 (0x00)
        unsigned char remote_mep_id[12] = 0 (0x00)
        unsigned char remote_mep_id[13] = 0 (0x00)
        unsigned char remote_mep_id[14] = 0 (0x00)
        unsigned char remote_mep_id[15] = 0 (0x00)
        unsigned char remote_mep_id[16] = 0 (0x00)
        unsigned char remote_mep_id[17] = 0 (0x00)
        unsigned char remote_mep_id[18] = 0 (0x00)
        unsigned char remote_mep_id[19] = 0 (0x00)
        unsigned char remote_mep_id[20] = 0 (0x00)
        unsigned char remote_mep_id[21] = 0 (0x00)
        unsigned char remote_mep_id[22] = 0 (0x00)
        unsigned char remote_mep_id[23] = 0 (0x00)
        unsigned char remote_mep_id[24] = 0 (0x00)
        unsigned char remote_mep_id[25] = 0 (0x00)
        unsigned char remote_mep_id[26] = 0 (0x00)
        unsigned char remote_mep_id[27] = 0 (0x00)
        unsigned char remote_mep_id[28] = 0 (0x00)
        unsigned char remote_mep_id[29] = 0 (0x00)
        unsigned char remote_mep_id[30] = 0 (0x00)
        unsigned char remote_mep_id[31] = 0 (0x00)
    }
    unsigned char remote_mep_id_length = 0 (0x00)
    unsigned char[32] mis_conn_mep_id = {
        unsigned char mis_conn_mep_id[0] = 0 (0x00)
        unsigned char mis_conn_mep_id[1] = 0 (0x00)
        unsigned char mis_conn_mep_id[2] = 0 (0x00)
        unsigned char mis_conn_mep_id[3] = 0 (0x00)
        unsigned char mis_conn_mep_id[4] = 0 (0x00)
        unsigned char mis_conn_mep_id[5] = 0 (0x00)
        unsigned char mis_conn_mep_id[6] = 0 (0x00)
        unsigned char mis_conn_mep_id[7] = 0 (0x00)
        unsigned char mis_conn_mep_id[8] = 0 (0x00)
        unsigned char mis_conn_mep_id[9] = 0 (0x00)
        unsigned char mis_conn_mep_id[10] = 0 (0x00)
        unsigned char mis_conn_mep_id[11] = 0 (0x00)
        unsigned char mis_conn_mep_id[12] = 0 (0x00)
        unsigned char mis_conn_mep_id[13] = 0 (0x00)
        unsigned char mis_conn_mep_id[14] = 0 (0x00)
        unsigned char mis_conn_mep_id[15] = 0 (0x00)
        unsigned char mis_conn_mep_id[16] = 0 (0x00)
        unsigned char mis_conn_mep_id[17] = 0 (0x00)
        unsigned char mis_conn_mep_id[18] = 0 (0x00)
        unsigned char mis_conn_mep_id[19] = 0 (0x00)
        unsigned char mis_conn_mep_id[20] = 0 (0x00)
        unsigned char mis_conn_mep_id[21] = 0 (0x00)
        unsigned char mis_conn_mep_id[22] = 0 (0x00)
        unsigned char mis_conn_mep_id[23] = 0 (0x00)
        unsigned char mis_conn_mep_id[24] = 0 (0x00)
        unsigned char mis_conn_mep_id[25] = 0 (0x00)
        unsigned char mis_conn_mep_id[26] = 0 (0x00)
        unsigned char mis_conn_mep_id[27] = 0 (0x00)
        unsigned char mis_conn_mep_id[28] = 0 (0x00)
        unsigned char mis_conn_mep_id[29] = 0 (0x00)
        unsigned char mis_conn_mep_id[30] = 0 (0x00)
        unsigned char mis_conn_mep_id[31] = 0 (0x00)
    }
    unsigned char mis_conn_mep_id_length = 0 (0x00)
    unsigned int bfd_detection_time = 0 (0x0)
    uint16 pkt_vlan_id = 0 (0x0000)
    uint16 rx_pkt_vlan_id = 0 (0x0000)
    uint32 gal_label = 0 (0x0)
    unsigned int faults = 0 (0x0)
    unsigned int flags2 = 0 (0x0)
    int ipv6_extra_data_index = 0 (0x0)
    int punt_good_packet_period = 0 (0x0)
    unsigned char bfd_period_cluster = 0 (0x00)
    unsigned int vxlan_vnid = 0 (0x0)
    unsigned short vlan_tpid = 0 (0x0000)
    unsigned short inner_vlan_tpid = 0 (0x0000)
    int injected_network_qos = 0 (0x0)
    int profile_id = 0 (0x0)
    unsigned char injected_core_id = 0 (0x00)
}
cint>
cint>
cint>
cint> bcm_bfd_endpoint_info_t_init(&ep_info);
cint>
cint> print bcm_bfd_endpoint_get(0, 4, &ep_info);
int $$ = 0 (0x0)
cint>
cint> print ep_info;
bcm_bfd_endpoint_info_t ep_info = {
    unsigned int flags = 128 (0x80)
    int id = 4 (0x4)
    int remote_id = 0 (0x0)
    bcm_bfd_tunnel_type_t type = bcmBFDTunnelTypeUdp (0)
    int gport = 67108939 (0x400004b)
    int tx_gport = -1 (0xffffffff)
    int remote_gport = -1 (0xffffffff)
    int bfd_period = 0 (0x0)
    bcm_vlan_t vpn = 0 (0x0000)
    unsigned char vlan_pri = 0 (0x00)
    unsigned char inner_vlan_pri = 0 (0x00)
    int vrf_id = 0 (0x0)
    uint8[6] dst_mac = 00:00:00:00:00:00
    uint8[6] src_mac = 00:00:00:00:00:00
    uint16 pkt_inner_vlan_id = 0 (0x0000)
    uint32 dst_ip_addr = 0.0.0.0
    uint8[16] dst_ip6_addr = 0062:0001:0001:0000:0000:0000:0000:0006
    uint32 src_ip_addr = 0.0.0.0
    uint8[16] src_ip6_addr = 0062:0001:0001:0000:0000:0000:0000:0001
    unsigned char ip_tos = 0 (0x00)
    unsigned char ip_ttl = 255 (0xff)
    uint32 inner_dst_ip_addr = 0.0.0.0
    uint8[16] inner_dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 inner_src_ip_addr = 0.0.0.0
    uint8[16] inner_src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char inner_ip_tos = 0 (0x00)
    unsigned char inner_ip_ttl = 0 (0x00)
    unsigned int udp_src_port = 49184 (0xc020)
    uint32 label = 0 (0x0)
    uint32 mpls_hdr = 0 (0x0)
    bcm_mpls_egress_label_t egress_label = {                                                                                                                                                                                                                                                                     [536/6547]
        unsigned int flags = 0 (0x0)
        unsigned int flags2 = 0 (0x0)
        uint32 label = 4294967295 (0xffffffff)
        int qos_map_id = 0 (0x0)
        unsigned char exp = 255 (0xff)
        unsigned char ttl = 0 (0x00)
        unsigned char pkt_pri = 0 (0x00)
        unsigned char pkt_cfi = 0 (0x00)
        int tunnel_id = 0 (0x0)
        int l3_intf_id = 0 (0x0)
        bcm_mpls_egress_action_t action = BCM_MPLS_EGRESS_ACTION_SWAP (0)
        int ecn_map_id = 0 (0x0)
        int int_cn_map_id = 0 (0x0)
        int egress_failover_id = 0 (0x0)
        int egress_failover_if_id = 0 (0x0)
        int outlif_counting_profile = -1 (0xffffffff)
        bcm_mpls_special_label_push_type_t spl_label_push_type = bcmMplsSpecialLabelPushNone (0)
        bcm_encap_access_t encap_access = bcmEncapAccessInvalid (0)
        bcm_qos_egress_model_t egress_qos_model = {
            bcm_qos_egress_model_type_t egress_qos = bcmQosEgressModelUniform (0)
            bcm_qos_egress_model_type_t egress_ttl = bcmQosEgressModelUniform (0)
            bcm_qos_egress_ecn_model_type_t egress_ecn = bcmQosEgressEcnModelInvalid (0)
        }
        int estimated_encap_size = 0 (0x0)
    }
    int egress_if = 100461 (0x1886d)
    unsigned char[32] mep_id = {
        unsigned char mep_id[0] = 0 (0x00)
        unsigned char mep_id[1] = 0 (0x00)
        unsigned char mep_id[2] = 0 (0x00)
        unsigned char mep_id[3] = 0 (0x00)
        unsigned char mep_id[4] = 0 (0x00)
        unsigned char mep_id[5] = 0 (0x00)
        unsigned char mep_id[6] = 0 (0x00)
        unsigned char mep_id[7] = 0 (0x00)
        unsigned char mep_id[8] = 0 (0x00)
        unsigned char mep_id[9] = 0 (0x00)
        unsigned char mep_id[10] = 0 (0x00)
        unsigned char mep_id[11] = 0 (0x00)
        unsigned char mep_id[12] = 0 (0x00)
        unsigned char mep_id[13] = 0 (0x00)
        unsigned char mep_id[14] = 0 (0x00)
        unsigned char mep_id[15] = 0 (0x00)
        unsigned char mep_id[16] = 0 (0x00)
        unsigned char mep_id[17] = 0 (0x00)
        unsigned char mep_id[18] = 0 (0x00)
        unsigned char mep_id[19] = 0 (0x00)
        unsigned char mep_id[20] = 0 (0x00)
        unsigned char mep_id[21] = 0 (0x00)
        unsigned char mep_id[22] = 0 (0x00)
        unsigned char mep_id[23] = 0 (0x00)
        unsigned char mep_id[24] = 0 (0x00)
        unsigned char mep_id[25] = 0 (0x00)
        unsigned char mep_id[26] = 0 (0x00)
        unsigned char mep_id[27] = 0 (0x00)
        unsigned char mep_id[28] = 0 (0x00)
        unsigned char mep_id[29] = 0 (0x00)
        unsigned char mep_id[30] = 0 (0x00)
        unsigned char mep_id[31] = 0 (0x00)
    }
    unsigned char mep_id_length = 0 (0x00)
    int int_pri = 7 (0x7)
    unsigned char cpu_qid = 0 (0x00)
    bcm_bfd_state_t local_state = bcmBFDStateUp (3)
    unsigned int local_discr = 33 (0x21)
    bcm_bfd_diag_code_t local_diag = bcmBFDDiagCodeNone (0)
    unsigned int local_flags = 0 (0x0)
    unsigned int local_min_tx = 1000000 (0xf4240)
    unsigned int local_min_rx = 1000000 (0xf4240)
    unsigned int local_min_echo = 0 (0x0)
    unsigned char local_detect_mult = 3 (0x03)
    bcm_bfd_auth_type_t auth = bcmBFDAuthTypeNone (0)
    unsigned int auth_index = 0 (0x0)
    unsigned int tx_auth_seq = 233230075 (0xde6cefb)
    unsigned int rx_auth_seq = 0 (0x0)
    unsigned int remote_flags = 0 (0x0)
    bcm_bfd_state_t remote_state = bcmBFDStateUp (3)
    unsigned int remote_discr = 12 (0xc)
    bcm_bfd_diag_code_t remote_diag = bcmBFDDiagCodeNone (0)
    unsigned int remote_min_tx = 150000 (0x249f0)
    unsigned int remote_min_rx = 150000 (0x249f0)
    unsigned int remote_min_echo = 0 (0x0)
    unsigned char remote_detect_mult = 3 (0x03)
    int sampling_ratio = 0 (0x0)
    unsigned char loc_clear_threshold = 0 (0x00)
    unsigned int ip_subnet_length = 0 (0x0)
    unsigned char[32] remote_mep_id = {
        unsigned char remote_mep_id[0] = 0 (0x00)
        unsigned char remote_mep_id[1] = 0 (0x00)
        unsigned char remote_mep_id[2] = 0 (0x00)
        unsigned char remote_mep_id[3] = 0 (0x00)
        unsigned char remote_mep_id[4] = 0 (0x00)
        unsigned char remote_mep_id[5] = 0 (0x00)
        unsigned char remote_mep_id[6] = 0 (0x00)
        unsigned char remote_mep_id[7] = 0 (0x00)
        unsigned char remote_mep_id[8] = 0 (0x00)
        unsigned char remote_mep_id[9] = 0 (0x00)
        unsigned char remote_mep_id[10] = 0 (0x00)
        unsigned char remote_mep_id[11] = 0 (0x00)
        unsigned char remote_mep_id[12] = 0 (0x00)
        unsigned char remote_mep_id[13] = 0 (0x00)
        unsigned char remote_mep_id[14] = 0 (0x00)
        unsigned char remote_mep_id[15] = 0 (0x00)
        unsigned char remote_mep_id[16] = 0 (0x00)
        unsigned char remote_mep_id[17] = 0 (0x00)
        unsigned char remote_mep_id[18] = 0 (0x00)
        unsigned char remote_mep_id[19] = 0 (0x00)
        unsigned char remote_mep_id[20] = 0 (0x00)
        unsigned char remote_mep_id[21] = 0 (0x00)
        unsigned char remote_mep_id[22] = 0 (0x00)
        unsigned char remote_mep_id[23] = 0 (0x00)
        unsigned char remote_mep_id[24] = 0 (0x00)
        unsigned char remote_mep_id[25] = 0 (0x00)
        unsigned char remote_mep_id[26] = 0 (0x00)
        unsigned char remote_mep_id[27] = 0 (0x00)
        unsigned char remote_mep_id[28] = 0 (0x00)
        unsigned char remote_mep_id[29] = 0 (0x00)
        unsigned char remote_mep_id[30] = 0 (0x00)
        unsigned char remote_mep_id[31] = 0 (0x00)
    }
    unsigned char remote_mep_id_length = 0 (0x00)
    unsigned char[32] mis_conn_mep_id = {
        unsigned char mis_conn_mep_id[0] = 0 (0x00)
        unsigned char mis_conn_mep_id[1] = 0 (0x00)
        unsigned char mis_conn_mep_id[2] = 0 (0x00)
        unsigned char mis_conn_mep_id[3] = 0 (0x00)
        unsigned char mis_conn_mep_id[4] = 0 (0x00)
        unsigned char mis_conn_mep_id[5] = 0 (0x00)
        unsigned char mis_conn_mep_id[6] = 0 (0x00)
        unsigned char mis_conn_mep_id[7] = 0 (0x00)
        unsigned char mis_conn_mep_id[8] = 0 (0x00)
        unsigned char mis_conn_mep_id[9] = 0 (0x00)
        unsigned char mis_conn_mep_id[10] = 0 (0x00)
        unsigned char mis_conn_mep_id[11] = 0 (0x00)
        unsigned char mis_conn_mep_id[12] = 0 (0x00)
        unsigned char mis_conn_mep_id[13] = 0 (0x00)
        unsigned char mis_conn_mep_id[14] = 0 (0x00)
        unsigned char mis_conn_mep_id[15] = 0 (0x00)
        unsigned char mis_conn_mep_id[16] = 0 (0x00)
        unsigned char mis_conn_mep_id[17] = 0 (0x00)
        unsigned char mis_conn_mep_id[18] = 0 (0x00)
        unsigned char mis_conn_mep_id[19] = 0 (0x00)
        unsigned char mis_conn_mep_id[20] = 0 (0x00)
        unsigned char mis_conn_mep_id[21] = 0 (0x00)
        unsigned char mis_conn_mep_id[22] = 0 (0x00)
        unsigned char mis_conn_mep_id[23] = 0 (0x00)
        unsigned char mis_conn_mep_id[24] = 0 (0x00)
        unsigned char mis_conn_mep_id[25] = 0 (0x00)
        unsigned char mis_conn_mep_id[26] = 0 (0x00)
        unsigned char mis_conn_mep_id[27] = 0 (0x00)
        unsigned char mis_conn_mep_id[28] = 0 (0x00)
        unsigned char mis_conn_mep_id[29] = 0 (0x00)
        unsigned char mis_conn_mep_id[30] = 0 (0x00)
        unsigned char mis_conn_mep_id[31] = 0 (0x00)
    }
    unsigned char mis_conn_mep_id_length = 0 (0x00)
    unsigned int bfd_detection_time = 0 (0x0)
    uint16 pkt_vlan_id = 0 (0x0000)
    uint16 rx_pkt_vlan_id = 0 (0x0000)
    uint32 gal_label = 0 (0x0)
    unsigned int faults = 0 (0x0)
    unsigned int flags2 = 0 (0x0)
    int ipv6_extra_data_index = 0 (0x0)
    int punt_good_packet_period = 0 (0x0)
    unsigned char bfd_period_cluster = 0 (0x00)
    unsigned int vxlan_vnid = 0 (0x0)
    unsigned short vlan_tpid = 0 (0x0000)
    unsigned short inner_vlan_tpid = 0 (0x0000)
    int injected_network_qos = 0 (0x0)
    int profile_id = 0 (0x0)
    unsigned char injected_core_id = 0 (0x00)
}
cint>
cint>
cint>
cint> bcm_bfd_endpoint_info_t_init(&ep_info);
cint>
cint> print bcm_bfd_endpoint_get(0, 5, &ep_info);
int $$ = 0 (0x0)
cint>
cint> print ep_info;
bcm_bfd_endpoint_info_t ep_info = {
    unsigned int flags = 128 (0x80)
    int id = 5 (0x5)
    int remote_id = 0 (0x0)
    bcm_bfd_tunnel_type_t type = bcmBFDTunnelTypeUdp (0)
    int gport = 201326594 (0xc000002)
    int tx_gport = -1 (0xffffffff)
    int remote_gport = -1 (0xffffffff)
    int bfd_period = 0 (0x0)
    bcm_vlan_t vpn = 0 (0x0000)
    unsigned char vlan_pri = 0 (0x00)
    unsigned char inner_vlan_pri = 0 (0x00)
    int vrf_id = 0 (0x0)
    uint8[6] dst_mac = 00:00:00:00:00:00
    uint8[6] src_mac = 00:00:00:00:00:00
    uint16 pkt_inner_vlan_id = 0 (0x0000)
    uint32 dst_ip_addr = 0.0.0.0
    uint8[16] dst_ip6_addr = fe80:0000:0000:0000:dac4:97ff:fed1:bb2c
    uint32 src_ip_addr = 0.0.0.0
    uint8[16] src_ip6_addr = fe80:0000:0000:0000:b6a9:fcff:fe09:f44f
    unsigned char ip_tos = 0 (0x00)
    unsigned char ip_ttl = 255 (0xff)
    uint32 inner_dst_ip_addr = 0.0.0.0
    uint8[16] inner_dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 inner_src_ip_addr = 0.0.0.0
    uint8[16] inner_src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char inner_ip_tos = 0 (0x00)
    unsigned char inner_ip_ttl = 0 (0x00)
    unsigned int udp_src_port = 49185 (0xc021)
    uint32 label = 0 (0x0)
    uint32 mpls_hdr = 0 (0x0)
    bcm_mpls_egress_label_t egress_label = {
        unsigned int flags = 0 (0x0)
        unsigned int flags2 = 0 (0x0)
        uint32 label = 4294967295 (0xffffffff)
        int qos_map_id = 0 (0x0)
        unsigned char exp = 255 (0xff)
        unsigned char ttl = 0 (0x00)
        unsigned char pkt_pri = 0 (0x00)
        unsigned char pkt_cfi = 0 (0x00)
        int tunnel_id = 0 (0x0)
        int l3_intf_id = 0 (0x0)
        bcm_mpls_egress_action_t action = BCM_MPLS_EGRESS_ACTION_SWAP (0)
        int ecn_map_id = 0 (0x0)
        int int_cn_map_id = 0 (0x0)
        int egress_failover_id = 0 (0x0)
        int egress_failover_if_id = 0 (0x0)
        int outlif_counting_profile = -1 (0xffffffff)
        bcm_mpls_special_label_push_type_t spl_label_push_type = bcmMplsSpecialLabelPushNone (0)
        bcm_encap_access_t encap_access = bcmEncapAccessInvalid (0)
        bcm_qos_egress_model_t egress_qos_model = {
            bcm_qos_egress_model_type_t egress_qos = bcmQosEgressModelUniform (0)
            bcm_qos_egress_model_type_t egress_ttl = bcmQosEgressModelUniform (0)
            bcm_qos_egress_ecn_model_type_t egress_ecn = bcmQosEgressEcnModelInvalid (0)
        }
        int estimated_encap_size = 0 (0x0)
    }
    int egress_if = 100463 (0x1886f)
    unsigned char[32] mep_id = {
        unsigned char mep_id[0] = 0 (0x00)
        unsigned char mep_id[1] = 0 (0x00)
        unsigned char mep_id[2] = 0 (0x00)
        unsigned char mep_id[3] = 0 (0x00)
        unsigned char mep_id[4] = 0 (0x00)
        unsigned char mep_id[5] = 0 (0x00)
        unsigned char mep_id[6] = 0 (0x00)
        unsigned char mep_id[7] = 0 (0x00)
        unsigned char mep_id[8] = 0 (0x00)
        unsigned char mep_id[9] = 0 (0x00)
        unsigned char mep_id[10] = 0 (0x00)
        unsigned char mep_id[11] = 0 (0x00)
        unsigned char mep_id[12] = 0 (0x00)
        unsigned char mep_id[13] = 0 (0x00)
        unsigned char mep_id[14] = 0 (0x00)
        unsigned char mep_id[15] = 0 (0x00)
        unsigned char mep_id[16] = 0 (0x00)
        unsigned char mep_id[17] = 0 (0x00)
        unsigned char mep_id[18] = 0 (0x00)
        unsigned char mep_id[19] = 0 (0x00)
        unsigned char mep_id[20] = 0 (0x00)
        unsigned char mep_id[21] = 0 (0x00)
        unsigned char mep_id[22] = 0 (0x00)
        unsigned char mep_id[23] = 0 (0x00)
        unsigned char mep_id[24] = 0 (0x00)
        unsigned char mep_id[25] = 0 (0x00)
        unsigned char mep_id[26] = 0 (0x00)
        unsigned char mep_id[27] = 0 (0x00)
        unsigned char mep_id[28] = 0 (0x00)
        unsigned char mep_id[29] = 0 (0x00)
        unsigned char mep_id[30] = 0 (0x00)
        unsigned char mep_id[31] = 0 (0x00)
    }
    unsigned char mep_id_length = 0 (0x00)
    int int_pri = 7 (0x7)
    unsigned char cpu_qid = 0 (0x00)
    bcm_bfd_state_t local_state = bcmBFDStateUp (3)
    unsigned int local_discr = 34 (0x22)
    bcm_bfd_diag_code_t local_diag = bcmBFDDiagCodeNone (0)
    unsigned int local_flags = 0 (0x0)
    unsigned int local_min_tx = 1000000 (0xf4240)
    unsigned int local_min_rx = 1000000 (0xf4240)
    unsigned int local_min_echo = 0 (0x0)
    unsigned char local_detect_mult = 3 (0x03)
    bcm_bfd_auth_type_t auth = bcmBFDAuthTypeNone (0)
    unsigned int auth_index = 0 (0x0)
    unsigned int tx_auth_seq = 1008377760 (0x3c1a9fa0)
    unsigned int rx_auth_seq = 0 (0x0)
    unsigned int remote_flags = 0 (0x0)
    bcm_bfd_state_t remote_state = bcmBFDStateUp (3)
    unsigned int remote_discr = 18 (0x12)
    bcm_bfd_diag_code_t remote_diag = bcmBFDDiagCodeNone (0)
    unsigned int remote_min_tx = 150000 (0x249f0)
    unsigned int remote_min_rx = 150000 (0x249f0)
    unsigned int remote_min_echo = 0 (0x0)
    unsigned char remote_detect_mult = 3 (0x03)
    int sampling_ratio = 0 (0x0)
    unsigned char loc_clear_threshold = 0 (0x00)
    unsigned int ip_subnet_length = 0 (0x0)
    unsigned char[32] remote_mep_id = {
        unsigned char remote_mep_id[0] = 0 (0x00)
        unsigned char remote_mep_id[1] = 0 (0x00)
        unsigned char remote_mep_id[2] = 0 (0x00)
        unsigned char remote_mep_id[3] = 0 (0x00)
       unsigned char remote_mep_id[4] = 0 (0x00)
        unsigned char remote_mep_id[5] = 0 (0x00)
        unsigned char remote_mep_id[6] = 0 (0x00)
        unsigned char remote_mep_id[7] = 0 (0x00)
        unsigned char remote_mep_id[8] = 0 (0x00)
        unsigned char remote_mep_id[9] = 0 (0x00)
        unsigned char remote_mep_id[10] = 0 (0x00)
        unsigned char remote_mep_id[11] = 0 (0x00)
        unsigned char remote_mep_id[12] = 0 (0x00)
        unsigned char remote_mep_id[13] = 0 (0x00)
        unsigned char remote_mep_id[14] = 0 (0x00)
        unsigned char remote_mep_id[15] = 0 (0x00)
        unsigned char remote_mep_id[16] = 0 (0x00)
        unsigned char remote_mep_id[17] = 0 (0x00)
        unsigned char remote_mep_id[18] = 0 (0x00)
        unsigned char remote_mep_id[19] = 0 (0x00)
        unsigned char remote_mep_id[20] = 0 (0x00)
        unsigned char remote_mep_id[21] = 0 (0x00)
        unsigned char remote_mep_id[22] = 0 (0x00)
        unsigned char remote_mep_id[23] = 0 (0x00)
        unsigned char remote_mep_id[24] = 0 (0x00)
        unsigned char remote_mep_id[25] = 0 (0x00)
        unsigned char remote_mep_id[26] = 0 (0x00)
        unsigned char remote_mep_id[27] = 0 (0x00)
        unsigned char remote_mep_id[28] = 0 (0x00)
        unsigned char remote_mep_id[29] = 0 (0x00)
        unsigned char remote_mep_id[30] = 0 (0x00)
        unsigned char remote_mep_id[31] = 0 (0x00)
    }
    unsigned char remote_mep_id_length = 0 (0x00)
    unsigned char[32] mis_conn_mep_id = {
        unsigned char mis_conn_mep_id[0] = 0 (0x00)
        unsigned char mis_conn_mep_id[1] = 0 (0x00)
        unsigned char mis_conn_mep_id[2] = 0 (0x00)
        unsigned char mis_conn_mep_id[3] = 0 (0x00)
        unsigned char mis_conn_mep_id[4] = 0 (0x00)
        unsigned char mis_conn_mep_id[5] = 0 (0x00)
        unsigned char mis_conn_mep_id[6] = 0 (0x00)
        unsigned char mis_conn_mep_id[7] = 0 (0x00)
        unsigned char mis_conn_mep_id[8] = 0 (0x00)
        unsigned char mis_conn_mep_id[9] = 0 (0x00)
        unsigned char mis_conn_mep_id[10] = 0 (0x00)
        unsigned char mis_conn_mep_id[11] = 0 (0x00)
        unsigned char mis_conn_mep_id[12] = 0 (0x00)
        unsigned char mis_conn_mep_id[13] = 0 (0x00)
        unsigned char mis_conn_mep_id[14] = 0 (0x00)
        unsigned char mis_conn_mep_id[15] = 0 (0x00)
        unsigned char mis_conn_mep_id[16] = 0 (0x00)
        unsigned char mis_conn_mep_id[17] = 0 (0x00)
        unsigned char mis_conn_mep_id[18] = 0 (0x00)
        unsigned char mis_conn_mep_id[19] = 0 (0x00)
        unsigned char mis_conn_mep_id[20] = 0 (0x00)
        unsigned char mis_conn_mep_id[21] = 0 (0x00)
        unsigned char mis_conn_mep_id[22] = 0 (0x00)
        unsigned char mis_conn_mep_id[23] = 0 (0x00)
        unsigned char mis_conn_mep_id[24] = 0 (0x00)
        unsigned char mis_conn_mep_id[25] = 0 (0x00)
        unsigned char mis_conn_mep_id[26] = 0 (0x00)
        unsigned char mis_conn_mep_id[27] = 0 (0x00)
        unsigned char mis_conn_mep_id[28] = 0 (0x00)
        unsigned char mis_conn_mep_id[29] = 0 (0x00)
        unsigned char mis_conn_mep_id[30] = 0 (0x00)
        unsigned char mis_conn_mep_id[31] = 0 (0x00)
    }
    unsigned char mis_conn_mep_id_length = 0 (0x00)
    unsigned int bfd_detection_time = 0 (0x0)
    uint16 pkt_vlan_id = 0 (0x0000)
    uint16 rx_pkt_vlan_id = 3966 (0x0f7e)
    uint32 gal_label = 0 (0x0)
    unsigned int faults = 0 (0x0)
    unsigned int flags2 = 0 (0x0)
    int ipv6_extra_data_index = 0 (0x0)
    int punt_good_packet_period = 0 (0x0)
    unsigned char bfd_period_cluster = 0 (0x00)
    unsigned int vxlan_vnid = 0 (0x0)
    unsigned short vlan_tpid = 0 (0x0000)
    unsigned short inner_vlan_tpid = 0 (0x0000)
    int injected_network_qos = 0 (0x0)
    int profile_id = 0 (0x0)
    unsigned char injected_core_id = 0 (0x00)
}
cint>
cint>
cint>
cint> bcm_bfd_endpoint_info_t_init(&ep_info);
cint>
cint>
cint> bcm_bfd_endpoint_info_t_init(&ep_info);
cint>
cint> print bcm_bfd_endpoint_get(0, 6, &ep_info);
int $$ = 0 (0x0)
cint>
cint> print ep_info;
bcm_bfd_endpoint_info_t ep_info = {
    unsigned int flags = 0 (0x0)
    int id = 6 (0x6)
    int remote_id = 0 (0x0)
    bcm_bfd_tunnel_type_t type = bcmBFDTunnelTypeUdp (0)
    int gport = 201326594 (0xc000002)
    int tx_gport = -1 (0xffffffff)
    int remote_gport = -1 (0xffffffff)
    int bfd_period = 0 (0x0)
    bcm_vlan_t vpn = 0 (0x0000)
    unsigned char vlan_pri = 0 (0x00)
    unsigned char inner_vlan_pri = 0 (0x00)
    int vrf_id = 0 (0x0)
    uint8[6] dst_mac = 00:00:00:00:00:00
    uint8[6] src_mac = 00:00:00:00:00:00
    uint16 pkt_inner_vlan_id = 0 (0x0000)
    uint32 dst_ip_addr = 62.1.1.6
    uint8[16] dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 src_ip_addr = 62.1.1.2
    uint8[16] src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char ip_tos = 0 (0x00)
    unsigned char ip_ttl = 255 (0xff)
    uint32 inner_dst_ip_addr = 0.0.0.0
    uint8[16] inner_dst_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    uint32 inner_src_ip_addr = 0.0.0.0
    uint8[16] inner_src_ip6_addr = 0000:0000:0000:0000:0000:0000:0000:0000
    unsigned char inner_ip_tos = 0 (0x00)
    unsigned char inner_ip_ttl = 0 (0x00)
    unsigned int udp_src_port = 49186 (0xc022)
    uint32 label = 0 (0x0)
    uint32 mpls_hdr = 0 (0x0)
    bcm_mpls_egress_label_t egress_label = {
        unsigned int flags = 0 (0x0)
        unsigned int flags2 = 0 (0x0)
        uint32 label = 4294967295 (0xffffffff)
        int qos_map_id = 0 (0x0)
        unsigned char exp = 255 (0xff)
        unsigned char ttl = 0 (0x00)
        unsigned char pkt_pri = 0 (0x00)
        unsigned char pkt_cfi = 0 (0x00)
        int tunnel_id = 0 (0x0)
        int l3_intf_id = 0 (0x0)
        bcm_mpls_egress_action_t action = BCM_MPLS_EGRESS_ACTION_SWAP (0)
        int ecn_map_id = 0 (0x0)
        int int_cn_map_id = 0 (0x0)
        int egress_failover_id = 0 (0x0)
        int egress_failover_if_id = 0 (0x0)
        int outlif_counting_profile = -1 (0xffffffff)
        bcm_mpls_special_label_push_type_t spl_label_push_type = bcmMplsSpecialLabelPushNone (0)
        bcm_encap_access_t encap_access = bcmEncapAccessInvalid (0)
        bcm_qos_egress_model_t egress_qos_model = {
            bcm_qos_egress_model_type_t egress_qos = bcmQosEgressModelUniform (0)
            bcm_qos_egress_model_type_t egress_ttl = bcmQosEgressModelUniform (0)
            bcm_qos_egress_ecn_model_type_t egress_ecn = bcmQosEgressEcnModelInvalid (0)
        }
        int estimated_encap_size = 0 (0x0)
    }
    int egress_if = 100464 (0x18870)
    unsigned char[32] mep_id = {
        unsigned char mep_id[0] = 0 (0x00)
        unsigned char mep_id[1] = 0 (0x00)
        unsigned char mep_id[2] = 0 (0x00)
        unsigned char mep_id[3] = 0 (0x00)
        unsigned char mep_id[4] = 0 (0x00)
        unsigned char mep_id[5] = 0 (0x00)
        unsigned char mep_id[6] = 0 (0x00)
        unsigned char mep_id[7] = 0 (0x00)
        unsigned char mep_id[8] = 0 (0x00)
        unsigned char mep_id[9] = 0 (0x00)
        unsigned char mep_id[10] = 0 (0x00)
        unsigned char mep_id[11] = 0 (0x00)
        unsigned char mep_id[12] = 0 (0x00)
        unsigned char mep_id[13] = 0 (0x00)
        unsigned char mep_id[14] = 0 (0x00)
        unsigned char mep_id[15] = 0 (0x00)
        unsigned char mep_id[16] = 0 (0x00)
        unsigned char mep_id[17] = 0 (0x00)
        unsigned char mep_id[18] = 0 (0x00)
        unsigned char mep_id[19] = 0 (0x00)
        unsigned char mep_id[20] = 0 (0x00)
        unsigned char mep_id[21] = 0 (0x00)
        unsigned char mep_id[22] = 0 (0x00)
        unsigned char mep_id[23] = 0 (0x00)
        unsigned char mep_id[24] = 0 (0x00)
        unsigned char mep_id[25] = 0 (0x00)
        unsigned char mep_id[26] = 0 (0x00)
        unsigned char mep_id[27] = 0 (0x00)
        unsigned char mep_id[28] = 0 (0x00)
        unsigned char mep_id[29] = 0 (0x00)
        unsigned char mep_id[30] = 0 (0x00)
        unsigned char mep_id[31] = 0 (0x00)
    }
    unsigned char mep_id_length = 0 (0x00)
    int int_pri = 7 (0x7)
    unsigned char cpu_qid = 0 (0x00)
    bcm_bfd_state_t local_state = bcmBFDStateDown (1)
    unsigned int local_discr = 35 (0x23)
    bcm_bfd_diag_code_t local_diag = bcmBFDDiagCodeNone (0)
    unsigned int local_flags = 0 (0x0)
    unsigned int local_min_tx = 1000000 (0xf4240)
    unsigned int local_min_rx = 1000000 (0xf4240)
    unsigned int local_min_echo = 0 (0x0)
    unsigned char local_detect_mult = 3 (0x03)
    bcm_bfd_auth_type_t auth = bcmBFDAuthTypeNone (0)
    unsigned int auth_index = 0 (0x0)
    unsigned int tx_auth_seq = 1708909974 (0x65dbe596)
    unsigned int rx_auth_seq = 0 (0x0)
    unsigned int remote_flags = 0 (0x0)
    bcm_bfd_state_t remote_state = bcmBFDStateDown (1)
    unsigned int remote_discr = 0 (0x0)
    bcm_bfd_diag_code_t remote_diag = bcmBFDDiagCodeNone (0)
    unsigned int remote_min_tx = 0 (0x0)
    unsigned int remote_min_rx = 1 (0x1)
    unsigned int remote_min_echo = 0 (0x0)
    unsigned char remote_detect_mult = 0 (0x00)
    int sampling_ratio = 0 (0x0)
    unsigned char loc_clear_threshold = 0 (0x00)
    unsigned int ip_subnet_length = 0 (0x0)
    unsigned char[32] remote_mep_id = {
        unsigned char remote_mep_id[0] = 0 (0x00)
        unsigned char remote_mep_id[1] = 0 (0x00)
        unsigned char remote_mep_id[2] = 0 (0x00)
        unsigned char remote_mep_id[3] = 0 (0x00)
        unsigned char remote_mep_id[4] = 0 (0x00)
        unsigned char remote_mep_id[5] = 0 (0x00)
        unsigned char remote_mep_id[6] = 0 (0x00)
        unsigned char remote_mep_id[7] = 0 (0x00)
        unsigned char remote_mep_id[8] = 0 (0x00)
        unsigned char remote_mep_id[9] = 0 (0x00)
        unsigned char remote_mep_id[10] = 0 (0x00)
        unsigned char remote_mep_id[11] = 0 (0x00)
        unsigned char remote_mep_id[12] = 0 (0x00)
        unsigned char remote_mep_id[13] = 0 (0x00)
        unsigned char remote_mep_id[14] = 0 (0x00)
        unsigned char remote_mep_id[15] = 0 (0x00)
        unsigned char remote_mep_id[16] = 0 (0x00)
        unsigned char remote_mep_id[17] = 0 (0x00)
        unsigned char remote_mep_id[18] = 0 (0x00)
        unsigned char remote_mep_id[19] = 0 (0x00)
        unsigned char remote_mep_id[20] = 0 (0x00)
        unsigned char remote_mep_id[21] = 0 (0x00)
        unsigned char remote_mep_id[22] = 0 (0x00)
        unsigned char remote_mep_id[23] = 0 (0x00)
        unsigned char remote_mep_id[24] = 0 (0x00)
        unsigned char remote_mep_id[25] = 0 (0x00)
        unsigned char remote_mep_id[26] = 0 (0x00)
        unsigned char remote_mep_id[27] = 0 (0x00)
        unsigned char remote_mep_id[28] = 0 (0x00)
        unsigned char remote_mep_id[29] = 0 (0x00)
        unsigned char remote_mep_id[30] = 0 (0x00)
        unsigned char remote_mep_id[31] = 0 (0x00)
    }
    unsigned char remote_mep_id_length = 0 (0x00)
    unsigned char[32] mis_conn_mep_id = {
        unsigned char mis_conn_mep_id[0] = 0 (0x00)
        unsigned char mis_conn_mep_id[1] = 0 (0x00)
        unsigned char mis_conn_mep_id[2] = 0 (0x00)
        unsigned char mis_conn_mep_id[3] = 0 (0x00)
        unsigned char mis_conn_mep_id[4] = 0 (0x00)
        unsigned char mis_conn_mep_id[5] = 0 (0x00)
        unsigned char mis_conn_mep_id[6] = 0 (0x00)
        unsigned char mis_conn_mep_id[7] = 0 (0x00)
        unsigned char mis_conn_mep_id[8] = 0 (0x00)
        unsigned char mis_conn_mep_id[9] = 0 (0x00)
        unsigned char mis_conn_mep_id[10] = 0 (0x00)
        unsigned char mis_conn_mep_id[11] = 0 (0x00)
        unsigned char mis_conn_mep_id[12] = 0 (0x00)
        unsigned char mis_conn_mep_id[13] = 0 (0x00)
        unsigned char mis_conn_mep_id[14] = 0 (0x00)
        unsigned char mis_conn_mep_id[15] = 0 (0x00)
        unsigned char mis_conn_mep_id[16] = 0 (0x00)
        unsigned char mis_conn_mep_id[17] = 0 (0x00)
        unsigned char mis_conn_mep_id[18] = 0 (0x00)
        unsigned char mis_conn_mep_id[19] = 0 (0x00)
        unsigned char mis_conn_mep_id[20] = 0 (0x00)
        unsigned char mis_conn_mep_id[21] = 0 (0x00)
        unsigned char mis_conn_mep_id[22] = 0 (0x00)
        unsigned char mis_conn_mep_id[23] = 0 (0x00)
        unsigned char mis_conn_mep_id[24] = 0 (0x00)
        unsigned char mis_conn_mep_id[25] = 0 (0x00)
        unsigned char mis_conn_mep_id[26] = 0 (0x00)
        unsigned char mis_conn_mep_id[27] = 0 (0x00)
        unsigned char mis_conn_mep_id[28] = 0 (0x00)
        unsigned char mis_conn_mep_id[29] = 0 (0x00)
        unsigned char mis_conn_mep_id[30] = 0 (0x00)
        unsigned char mis_conn_mep_id[31] = 0 (0x00)
    }
    unsigned char mis_conn_mep_id_length = 0 (0x00)
    unsigned int bfd_detection_time = 0 (0x0)
    uint16 pkt_vlan_id = 0 (0x0000)
    uint16 rx_pkt_vlan_id = 3966 (0x0f7e)
    uint32 gal_label = 0 (0x0)
    unsigned int faults = 0 (0x0)
    unsigned int flags2 = 0 (0x0)
    int ipv6_extra_data_index = 0 (0x0)
    int punt_good_packet_period = 0 (0x0)
    unsigned char bfd_period_cluster = 0 (0x00)
    unsigned int vxlan_vnid = 0 (0x0)
    unsigned short vlan_tpid = 0 (0x0000)
    unsigned short inner_vlan_tpid = 0 (0x0000)
    int injected_network_qos = 0 (0x0)
    int profile_id = 0 (0x0)
    unsigned char injected_core_id = 0 (0x00)
}
cint>

